Repository: aminemayouf/investing
Catalog: stocks/locales/*/LC_MESSAGES/*.po
Languages: fr

source: No keys found, please provide an API key or create an empty file and name it with the API key and place you key in key(s) under <keys> directory
fr: Aucune clé n'a été trouvée, merci de fournir une clé API ou créer un fichier vide, le nommer avec la clé et le placer sous le répertoire <keys>

source: Downloading the company's data...
fr: Téléchargement des données de l'entreprise...

source: The company's financial data could not be downloaded for the following reason
fr: Les données financières de l'entreprise n'ont pas pu être téléchargées pour la raison suivante

source: The company's balance-sheet data could not be downloaded for the following reason
fr: Les bilans de l'entreprise n'ont pas pu être téléchargées pour la raison suivante

source: Successfuly downloaded the company's data
fr: Les données de l'entreprise ont été téléchargées avec succès

source: Loading cached company's data...
fr: Chargement des donnée de l'entreprise sauvegardées localement...

source: Successfuly loaded cached company's data
fr: Les données de l'entreprise sauvegardées localement ont été chargées avec succès

source: Fundamental analysis of
fr: Analyse fondamentale de

source: Change in net income
fr: Évolution du résultat net

source: Slater likes smallcaps
fr: Slater aime les petites capitalisations

source: Slater prefers smallcaps
fr: Slater préfère les petites capitalisations

source: Mayer may consider this company as a potential 100-bagger provided it has and international expansion potential
fr: Mayer pourrait considérer cette entreprise comme une potentielle 100-bagger sous réserve d'une potentielle expansion à l'international

source: Mayer may not consider this company as a potential 100-bagger
fr: Mayer pourrait ne pas considérer cette entreprise comme une potentielle 100-bagger

source: Profitability
fr: Rentabilité

source: The gross margin is higher than
fr: La marge brute est supérieure à

source: The gross margin is lower than
fr: La marge brute est inférieure à

source: Gross margin
fr: Marge brute

source: Operating margin
fr: Marge opérationnelle

source: The net margin is higher than
fr: La marge nette est supérieure à

source: The net margin is lower than
fr: La marge nette est inférieure à

source: Net margin
fr: Marge nette

source: Overral financial performance
fr: Performance financière

source: bad
fr: mauvais

source: good
fr: bon

source: Management effectivness
fr: Efficacité du management

source: The return on capital employed is higher than
fr: Le retour sur capitaux employés est supérieur à

source: The return on capital employed is lower than
fr: Le retour sur capitaux employés est inférieur à

source: Balance sheet
fr: Situation financière

source: The current ratio is higher than
fr: Le ratio de liquidité générale est supérieur à

source: However, you should note that the current ratio is higher than
fr: Cependant, vous devez noter que le ratio ratio de liquidité générale est supérieur à

source: which may indicate mismanagement of money due to an inability to collect payments
fr: ce qui peut indiquer une mauvaise gestion de l'argent due à une incapacité à récupérer les paiements

source: The current ratio is lower than
fr: Le ratio de liquidité générale est inférieur à

source: very bad
fr: très mauvais

source: The company must acquire new debt to pay its debt obligations
fr: L'entreprise doit acquérir de la dette nouvelle pour payer ses obligations de dette

source: Current ratio
fr: Ratio de liquidité générale

source: The company has good financials, it's QR is higher than
fr: L'entreprise a une bonne situation financière, son QR est supérieur à

source: The company doesn't have good financials, it's QR is lower than
fr: L'entreprise n'a pas une bonne situation financière, son QR est inférieur à

source: Selling, General and Administrative expenses represent less than 30% of the gross margin
fr: Les frais de vente, dépenses administratives et autres frais généraux représentent moins de de 30% de la marge brute

source: Selling, General and Administrative expenses represent more than 30% of the gross margin
fr: Les frais de vente, dépenses administratives et autres frais généraux représentent plus de 30% de la marge brute

source: The depreciation is low
fr: La dépréciation est faible

source: The depreciation is high
fr: La dépréciation est forte

source: The interest expense is lower than
fr: La charge d'intérêts est inférieure à

source: The interest expense is higher than
fr: La charge d'intérêts est supérieure à

source: The net earnings follow an upward trend over a period of
fr: Les résultats nets suivent une tendance haussière sur une période de

source: years
fr: ans

source: The net earnings follow a downward trend over a period of
fr: Les résultats nets suivent une tendance baissière sur une période de

source: The annual earnings growth rate is higher than
fr: Le taux de croissance annuel des bénéfices est supérieur à

source: The annual earnings growth rate is lower than
fr: Le taux de croissance annuel des bénéfices est inférieur à

source: The company has a significant amount of cash which increases by
fr: L'entreprise dispose d'une trésorerie importante qui augmente de

source: on average per year
fr: en moyenne par an

source: The company draws on it's cash
fr: L'entreprise puise dans sa trésorerie

source: The company is in a strong position, its long-term debt to net income ratio is less than
fr: L'entreprise est en position de force, son ratio dettes long terme résultats nets est inférieur à

source: The company is not in a strong position, its long-term debt to net income ratio is greater than
fr: L'entreprise n'est pas en position de force, son ratio dettes long terme résultats nets est inférieur à

source: Inventories move in line with profits
fr: Les stocks évoluent en ligne avec les bénéfices

source: Inventories do not move in line with profits (to be taken into account only if the products sold may become obsolete)
fr: Les stocks n'évoluent pas en ligne avec les bénéfices (à prendre en compte seulement si les produits vendus peuvent devenir obsolètes)

source: Tangible fixed assets (PPE) are reasonable: the tangible fixed assets to net income ratio is less than
fr: Les immobilisations corporelles (PPE) sont raisonnables: le ratio immobilisations corporelles résultats nets est inférieur à

source: The tangible fixed assets (PPE) are not very reasonable: the tangible fixed assets to net income ratio is greater than
fr: Les immobilisations corporelles (PPE) ne sont pas très raisonnables: le ratio immobilisations corporelles résultats nets est supérieur à

source: Capital expenditures are reasonable, they represent less than 50% of the net income
fr: Les dépenses d'investissement sont raisonnables, elles représentent moins de 50% des bénéfices net

source: Capital expenditures are not very reasonable, they represent more than 50% of the net income
fr: Les dépenses d'investissement ne sont pas très raisonnables, elles représentent plus de 50% des bénéfices net

source: The stock value of
fr: La valeur

source: meets some of Warren Buffet's selection criteria
fr: répond à certains critères de sélection de Warren Buffet

source: meets most of Warren Buffet's selection criteria
fr: répond à la plupart des critères de sélection de Warren Buffet

source: does not meet Warren Buffet's selection criteria
fr: ne répond pas aux critères de sélection de Warren Buffet

source: Recommendation
fr: Recommandation

source: Pros
fr: Les +

source: Cons
fr: Les -

source: meets some of Jim Slater's selection criteria
fr: répond à certains critères de sélection de Jim Slater

source: meets most of Jim Slater's selection criteria
fr: répond à la plupart des critères de sélection de Jim Slater

source: does not meet Jim Slater's selection criteria
fr: ne répond pas aux critères de sélection de Jim Slater

source: meets some of Chris Mayer's selection criteria
fr: répond à certains critères de sélection de Chris Mayer

source: meets most of Chris Mayer's selection criteria
fr: répond à la plupart des critères de sélection de Chris Mayer

source: does not meet Chris Mayer's selection criteria
fr: ne répond pas aux critères de sélection de Chris Mayer

source: The specified language was not found, the default language will be used
fr: La langue spécifiée n'a pas été trouvée, la langue par défaut sera utilisée
